{
  "intents": [
    {
      "tag": "Greeting",
      "patterns": [
        "Hi", "Hello", "Hey", "Good morning", "Good evening",
        "Hey there", "Greetings", "Hi Chatbot", "Hello Chatbot",
        "Hey Chatbot", "Hi friend", "Hello there", "How are you?"
      ],
      "responses": [
        "Hello! I'm really glad you reached out today. Whether you're feeling great or going through a tough time, I'm here to listen and help however I can. Let's talk and work through it together. You're not alone in this journey.",
        "Hi there! It's good to hear from you. If there's anything on your mind - whether it's stress, anxiety, or just needing a friendly chat - I'm here for you. Take your time and let's go at your pace.",
        "Hey! I hope you're doing well. But if you're not, that's completely okay too. I'm here to support you emotionally, mentally, or just to keep you company. What would you like to talk about today?",
        "Hello, and thank you for taking the step to check in. I know reaching out isn't always easy. You're doing something brave right now. I'm here to walk beside you through whatever you're facing."
      ],
      "context_set": ""
    },
    {
      "tag": "FeelingSad",
      "patterns": [
        "I feel sad", "I'm unhappy", "Feeling blue", "I am down",
        "I feel low", "Feeling depressed", "I feel hopeless",
        "Tears keep coming", "I feel emotionally drained",
        "I can't stop crying", "My heart hurts", "Sadness overwhelms me"
      ],
      "responses": [
        "I'm really sorry you're feeling this way. It sounds like you're carrying a heavy emotional burden, and that can be exhausting. Please know it's okay to feel what you're feeling, and you're not weak for needing support. I'm here for you.",
        "It takes courage to admit when we're feeling down. You're not alone, even though it might feel like it. Sometimes just having someone to talk to can help ease the weight a little. I'm here to listen, no judgment at all.",
        "Sadness can come and go, or it can stick around longer than we'd like. Whatever you're going through, please know that your feelings are valid and you matter. Would you like to talk more about what's been making you feel this way?",
        "Feeling low doesn't mean you're broken - it means you're human. I'm right here with you. You don't have to hide or pretend. If you'd like, we can explore some things that might help ease the sadness, even just a little."
      ],
      "context_set": ""
    },
    {
      "tag": "Anxiety",
      "patterns": [
        "I'm anxious", "I feel nervous", "My heart races",
        "I can't stop worrying", "Feeling anxious", "Panic feelings",
        "I am scared for no reason", "I feel uneasy", "My chest is tight",
        "I keep overthinking", "I feel out of control", "I get anxious in public"
      ],
      "responses": [
        "It sounds like you're feeling overwhelmed right now, and I want you to know that's okay. Anxiety can feel very real and very intense, but there are ways to manage it. Let's try to slow things down together and take one calming step at a time.",
        "Anxiety has a way of tricking our minds into thinking we're in danger, even when we're not. But you're safe here. I can help guide you through a breathing or grounding exercise, or we can simply talk it through. You're doing better than you think.",
        "I know anxiety can be exhausting - mentally and physically. It's like your mind is racing and won't slow down. Let's take this one moment at a time. I'm here for you, and together we can explore ways to help you feel more grounded.",
        "You're not alone in feeling this way. Many people experience anxiety and still find strength within themselves. If you're open to it, I can share calming techniques or just be a presence while you ride it out. Whatever you need, I'm here."
      ],
      "context_set": ""
    },
    {
      "tag": "SleepIssues",
      "patterns": [
        "I can't sleep", "Insomnia", "Trouble falling asleep",
        "I stay awake all night", "I wake up too early",
        "Restless nights", "My mind won't shut off", "Sleep problems",
        "I feel tired but can't sleep", "I can't relax at night"
      ],
      "responses": [
        "Sleep issues can be incredibly frustrating. It's hard when your body is tired but your mind won't settle. Sometimes creating a calming bedtime routine or writing out thoughts before bed can help ease you into rest. I'm happy to offer tips if you'd like.",
        "You're not alone - many people struggle with falling or staying asleep. Avoiding screens before bed, keeping a consistent routine, and doing light relaxation exercises can help. Would you like some calming strategies to try tonight?",
        "When we carry emotional stress or anxiety, sleep often suffers. That doesn't mean you're broken - it means your body and mind are overwhelmed. Let's work together to explore ways to help you get more restful, healing sleep.",
        "Lack of sleep can really take a toll on both mood and mental clarity. It's important to take it seriously. If it continues, you might consider talking to a professional. In the meantime, I can share techniques to quiet the mind before bed."
      ],
      "context_set": ""
    },
    {
      "tag": "Stress",
      "patterns": [
        "I'm stressed", "I feel overwhelmed", "Too much pressure",
        "I can't handle this", "Stress is getting to me", "I'm at my limit",
        "Work stress is too much", "I feel like I'm going to snap",
        "Everything is piling up", "I can't focus from stress"
      ],
      "responses": [
        "Stress can make even small tasks feel like mountains. It's okay to step back, breathe, and take one thing at a time. You don't have to carry it all at once. I'm here to help you sort through the chaos and find a bit of calm.",
        "It's completely understandable to feel overwhelmed when life demands more than you can give. You're human, and it's okay to have limits. Let's talk through what's stressing you out, or I can guide you through a calming exercise if you prefer.",
        "We often try to power through stress alone, but it's okay to ask for help. Talking things out can lighten the mental load. I'm here to listen and help you find small, doable ways to reduce the pressure you're feeling.",
        "You're under a lot right now, and that's not easy. Remember, even just pausing to breathe is a step toward relief. Let's look at ways to restore balance and give your mind a break. You don't have to face it all alone."
      ],
      "context_set": ""
    },
    {
      "tag": "Loneliness",
      "patterns": [
        "I feel lonely", "No one understands me", "I have no friends",
        "I'm all alone", "I feel isolated", "I don't belong anywhere",
        "I'm surrounded but feel alone", "No one talks to me"
      ],
      "responses": [
        "Loneliness can feel really heavy, like you're invisible in a crowded room. But I see you, and I'm here for you. Connection is possible, even when it doesn't feel like it. Let's talk through how you're feeling - you don't have to face this alone.",
        "It's normal to feel lonely sometimes, but that doesn't mean you're unlovable or unwanted. Your feelings are valid, and there are ways to reconnect with others and yourself. I'm here to support you while we figure out the next step.",
        "Feeling alone doesn't mean you're alone. I know that sounds strange, but many people silently face the same struggle. You're not weak for needing companionship, and opening up is already a brave first step toward connection.",
        "You matter, even if you don't feel it right now. The world can feel distant, but you're not forgotten. I'm glad you reached out. Would you like ideas on how to connect with others or talk about what's making you feel this way?"
      ],
      "context_set": ""
    },
    {
      "tag": "Motivation",
      "patterns": [
        "I feel unmotivated", "I can't do anything", "I don't want to try",
        "I feel lazy", "I have no energy", "I can't focus on tasks",
        "I don't feel like doing anything", "What's the point of trying?"
      ],
      "responses": [
        "It's completely okay to feel a lack of motivation - especially when life feels overwhelming. Small steps can lead to big change. Even getting out of bed or taking a shower can be a win. Be kind to yourself, you're doing your best.",
        "Motivation doesn't always come easily, and that's okay. Sometimes we just need a little spark to reignite it. Let's try setting one tiny goal for today, something manageable. Progress matters more than perfection.",
        "You're not alone in feeling stuck. Life can weigh you down, and that can smother your drive. But motivation can return with rest, purpose, and patience. I'm here to help you take the first step - one moment at a time.",
        "Sometimes, the pressure to 'do more' kills the motivation itself. You're allowed to rest, recharge, and move at your own pace. Let's talk about what's blocking your energy and find a gentle way to lift that weight together."
      ],
      "context_set": ""
    },
    {
      "tag": "TherapyEncouragement",
      "patterns": [
        "Should I see a therapist?", "Is therapy helpful?",
        "How to find a counselor?", "Do I need professional help?",
        "Can a therapist help me?", "Is therapy worth it?",
        "I'm scared to see a therapist", "Will counseling help me?"
      ],
      "responses": [
        "Therapy can be a powerful and healing experience. It's not about being 'broken' - it's about gaining support, tools, and clarity. It's a safe space to be fully yourself. Taking that first step is incredibly brave.",
        "So many people benefit from therapy, even if they aren't sure where to start. You deserve support and understanding, and a therapist can help you find healthier ways to cope. Would you like help finding a provider?",
        "It's normal to feel nervous about seeing a therapist. But therapy is about helping you heal and grow - not judging you. Everyone needs help sometimes, and there's nothing weak about seeking it. It's a strong step toward feeling better.",
        "Talking to a professional can bring clarity and peace over time. Therapy isn't just for when things are really bad - it can also help you grow emotionally. If you're thinking about it, that's already a sign you're ready to care for yourself."
      ],
      "context_set": ""
    },
    {
      "tag": "PositiveAffirmations",
      "patterns": [
        "Give me a positive quote", "Say something encouraging",
        "I need motivation", "Tell me something positive",
        "Can you uplift me?", "I need hope", "Say something nice"
      ],
      "responses": [
        "You are doing better than you think. Even if today feels hard, you're still here and that matters. Every step you take is proof of your strength. Keep going - your story isn't over yet.",
        "You are enough just as you are. You don't have to have it all figured out right now. One small step at a time can still lead to something beautiful. I believe in you, even when it's hard to believe in yourself.",
        "Your presence in this world matters. You bring something unique that no one else does. Even if you feel like you're struggling, you're still worthy of love, joy, and peace. Brighter days are coming.",
        "Sometimes you just need to hear this: you are not a burden. You're allowed to take up space, to rest, to feel, and to heal. You are strong, even when you feel weak. Keep holding on - light always returns."
      ],
      "context_set": ""
    },
    {
      "tag": "Mindfulness",
      "patterns": [
        "What is mindfulness?", "How to meditate?", "Help me focus",
        "Mindfulness exercises", "I want to be present", "How to stop overthinking?",
        "Teach me mindfulness", "How to calm my mind?"
      ],
      "responses": [
        "Mindfulness is the practice of gently bringing your attention back to the present moment. It helps you become aware of your thoughts without being overwhelmed by them. You don't need to be perfect - just present. Would you like a simple exercise to try?",
        "Being mindful means noticing your breath, your body, and your thoughts without judgment. Even a minute of mindfulness can ease anxiety and bring calm. We can practice it together now if you'd like to give it a try.",
        "Mindfulness isn't about clearing your mind - it's about learning to sit with whatever is there. With time and practice, it can reduce stress and improve focus. You can start with just a few deep breaths. Want help with that?",
        "If your thoughts feel scattered, mindfulness can help you return to a place of calm and clarity. You deserve moments of peace. I can walk you through a quick breathing or grounding technique whenever you're ready."
      ],
      "context_set": ""
    },
    {
      "tag": "CopingWithAnger",
      "patterns": [
        "I feel angry", "I'm mad", "How to calm anger?",
        "I get frustrated easily", "I lose my temper",
        "I get irritated quickly", "I don't know how to control my anger",
        "Anger issues", "Feeling furious"
      ],
      "responses": [
        "Feeling anger is natural and okay - it's a valid emotion that signals something needs attention. What matters is how you handle it. Taking deep breaths, counting slowly, or stepping away can help cool down those intense feelings. I'm here to help you find ways to express your anger safely.",
        "Anger can sometimes feel overwhelming and all-consuming, but remember, you can regain control. Try pausing before reacting, and allow yourself to reflect on what's really causing the anger. Would you like some calming techniques or ways to channel your frustration productively?",
        "It's tough when anger feels like it takes over your thoughts and actions. You're not alone in this struggle, and managing anger is a skill that can be learned over time. If you want, I can guide you through exercises that have helped others find peace and patience.",
        "Expressing anger doesn't mean hurting yourself or others. Finding healthy outlets - like journaling, physical activity, or talking to someone - can make a big difference. I'm here if you want to explore those options together or just need to vent."
      ],
      "context_set": ""
    },
    {
      "tag": "EatingDisorders",
      "patterns": [
        "I don't want to eat", "I overeat", "I feel guilty after eating",
        "Eating problems", "I have no appetite", "I binge eat",
        "I feel out of control with food", "I restrict food",
        "I'm scared about my eating habits"
      ],
      "responses": [
        "Eating struggles are deeply challenging, and it's important to recognize they aren't your fault. These feelings and behaviors are symptoms of a serious issue that deserves compassion and professional support. You deserve care and healing, and help is available.",
        "It's brave to acknowledge when food feels like a problem. Whether it's restricting, binging, or guilt, these patterns often come from deeper emotional pain. You don't have to face this alone - talking to a therapist or support group can be a vital step.",
        "Your body and mind deserve kindness, even when eating feels complicated or scary. Recovery is possible with the right support and patience. If you want, I can share resources or help you find someone who understands these struggles.",
        "Remember, you're more than your eating habits. You're worthy of love, health, and happiness. Small steps toward recovery can make a huge difference over time. I'm here to listen and support you as you navigate this journey."
      ],
      "context_set": ""
    },
    {
      "tag": "SocialAnxiety",
      "patterns": [
        "I get nervous in social situations", "I avoid people", "I feel judged",
        "Social anxiety", "I'm scared to talk to others",
        "I worry what people think of me", "I feel awkward around people",
        "I get shy easily", "I fear social gatherings"
      ],
      "responses": [
        "Social anxiety can make even simple interactions feel terrifying. Remember, you're not alone in this, and many people experience the same fears. With gentle practice and support, you can build confidence and enjoy social moments more comfortably.",
        "It's okay to feel nervous about social situations. Your feelings are valid, and you don't have to push yourself too hard all at once. Would you like some strategies to ease anxiety or tips for approaching social events step-by-step?",
        "Worrying about being judged is a common experience in social anxiety. Remember, most people are more focused on themselves than on judging others. You're worthy of connection and kindness just as you are. I'm here to support you whenever you need.",
        "Feeling shy or awkward is part of being human, but it doesn't define you. Small, manageable social goals can help you gradually build confidence. If you want, we can talk about ways to face your fears safely and with care."
      ],
      "context_set": ""
    },
   {
      "tag": "PanicAttack",
      "patterns": [
        "I am having a panic attack",
        "I can't breathe",
        "My chest hurts",
        "Feeling dizzy and scared",
        "I feel like I’m dying",
        "My heart is racing",
        "I feel out of control",
        "I’m scared right now",
        "Panic attack symptoms"
      ],
      "responses": [
        "Panic attacks can be incredibly frightening, but they are not dangerous and will pass. Try to focus on your breath—inhale slowly for 4 seconds, hold for 7, then exhale for 8. This technique helps calm your nervous system and regain control.",
        "When panic strikes, grounding yourself can help. Try naming five things you can see, four things you can touch, three sounds you hear, two things you can smell, and one thing you can taste. This exercise brings you back to the present moment.",
        "You’re safe, even if it doesn’t feel that way. Panic attacks are overwhelming sensations but do not cause harm. If symptoms become severe or you feel unsure, it’s important to seek medical advice. Remember, this will pass.",
        "Having a plan for panic attacks can help reduce fear. Would you like me to guide you through calming exercises or talk about ways to prepare for these moments? You're not alone, and support is available."
      ],
      "context_set": ""
    },
    {
      "tag": "Gratitude",
      "patterns": [
        "Thank you",
        "Thanks a lot",
        "I appreciate it",
        "Thanks",
        "Thanks for your help",
        "Thank you so much",
        "Thanks for listening",
        "I’m grateful"
      ],
      "responses": [
        "You’re very welcome! It means a lot that you reached out and shared. Remember, I’m here anytime you need someone to talk to or support you through tough moments.",
        "I’m glad I could be here for you. Gratitude can help shift perspective and bring light to dark days. Keep nurturing that feeling—it’s a powerful tool for well-being.",
        "Thank you for your kind words! It’s a privilege to support you. Please don’t hesitate to return whenever you want to talk or need guidance.",
        "I appreciate you too! Taking the step to communicate your feelings is a brave and important act. Keep taking care of yourself—you deserve it."
      ],
      "context_set": ""
    },
    {
      "tag": "Goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "See you later",
        "Talk to you later",
        "Catch you later",
        "I’m leaving now",
        "Thanks, bye",
        "Have a good day"
      ],
      "responses": [
        "Goodbye! Please take good care of yourself and remember I’m here whenever you want to talk again.",
        "See you later! Wishing you peace and strength until next time.",
        "Take care of yourself. Don’t hesitate to come back anytime you need support or just want to chat.",
        "It was good talking with you. Stay well, and remember you’re never alone in this journey."
      ],
      "context_set": ""
    },
    {
      "tag": "Reassurance",
      "patterns": [
        "Will things get better?",
        "Is it going to be okay?",
        "I'm scared about the future",
        "What if it never changes?",
        "Will I be alright?",
        "I’m worried about what’s next",
        "Is there hope?",
        "I feel uncertain about everything",
        "Can things improve?"
      ],
      "responses": [
        "It’s completely natural to feel scared when facing uncertainty. Remember that life is full of ups and downs, and with time and support, situations often improve. You are stronger than you realize, even if it doesn’t feel that way right now.",
        "Change can be scary, but it also brings opportunities for growth and healing. Taking things one step at a time helps make the future feel less overwhelming. You’re not alone, and together we can explore ways to find hope and stability.",
        "Your feelings of fear and uncertainty are valid, but they don’t define your future. Many people have felt lost and found their way to brighter days. Support and patience can help you navigate this challenging time.",
        "Hope is real, even when it’s hard to see. Small positive moments can build up over time, and every effort you make to care for yourself contributes to healing. You deserve to feel peace and confidence in what lies ahead."
      ],
      "context_set": ""
    },
    {
      "tag": "StressReliefExercise",
      "patterns": [
        "Give me a relaxation exercise",
        "Help me relax",
        "I want to calm down",
        "Stress relief tips",
        "How to relax my mind?",
        "Feeling stressed out",
        "I need to destress",
        "How to reduce stress quickly?",
        "Relaxation techniques"
      ],
      "responses": [
        "A simple and effective relaxation technique is deep breathing: breathe in slowly through your nose for four seconds, hold for seven seconds, then breathe out gently through your mouth for eight seconds. Repeat this several times to help calm your nervous system and reduce stress.",
        "Progressive muscle relaxation can be very helpful. This involves tensing and then relaxing each muscle group in your body, starting from your toes and moving up to your head. It helps your body release tension and your mind feel calmer.",
        "Mindfulness meditation is a powerful tool to ease stress. Focusing your attention on the present moment, your breath, or your surroundings without judgment helps you break the cycle of stressful thoughts. Would you like me to guide you through a mindfulness session?",
        "Sometimes, just taking a short break, stepping outside, or listening to calming music can work wonders. Self-care and patience with yourself are essential when managing stress. Remember, you deserve moments of peace."
      ],
      "context_set": ""
    },
    {
      "tag": "TraumaSupport",
      "patterns": [
        "I was traumatized",
        "I have PTSD",
        "I feel scared because of past events",
        "Trauma problems",
        "I keep reliving bad memories",
        "I feel unsafe",
        "I’m haunted by my past",
        "How to deal with trauma?",
        "I need help with trauma"
      ],
      "responses": [
        "Trauma can deeply affect your sense of safety and peace, but healing is possible with the right support. Talking to a professional trained in trauma therapy can provide tools to help you process these difficult experiences safely.",
        "It’s important to honor your feelings and understand that recovery takes time. You deserve to feel secure and supported, and reaching out for help is a courageous step toward healing. I can help you find resources if you'd like.",
        "Trauma responses are natural reactions to overwhelming experiences. You are not broken or alone. Healing involves gentle care for yourself and sometimes professional guidance to navigate triggers and painful memories safely.",
        "You’re worthy of love, safety, and peace. Remember, healing is not linear, and it’s okay to have tough days. If you want, I can share coping strategies or ways to find trauma-informed support."
      ],
      "context_set": ""
    },
    {
      "tag": "RelationshipIssues",
      "patterns": [
        "I have problems with my partner",
        "My relationship is difficult",
        "I feel lonely in my relationship",
        "Relationship stress",
        "We keep arguing",
        "I don’t feel understood by my partner",
        "How to improve my relationship?",
        "I feel disconnected",
        "Relationship troubles"
      ],
      "responses": [
        "Relationships can bring both joy and challenges. Communication is often key to understanding each other better and resolving conflicts. Taking time to listen and share honestly can help rebuild connection and trust.",
        "Feeling lonely in a relationship is painful, but it’s a common experience. You deserve to feel valued and supported. Sometimes couples therapy or counseling can help partners learn healthier ways to connect and communicate.",
        "Conflict is natural, but it’s important how it’s handled. Finding calm moments to discuss feelings openly and respectfully can reduce stress and bring clarity. I’m here if you want to talk about specific issues or explore ways to strengthen your bond.",
        "Remember, you deserve a relationship that supports your well-being and growth. Taking care of yourself and setting healthy boundaries is important too. If you want, I can provide resources or strategies to help you navigate relationship difficulties."
      ],
      "context_set": ""
    },
    {
      "tag": "FeelingHopeless",
      "patterns": [
        "I feel hopeless",
        "Nothing will get better",
        "I give up",
        "No way out",
        "I see no future",
        "I feel lost",
        "There’s no point",
        "I’m overwhelmed by sadness",
        "I don’t know what to do"
      ],
      "responses": [
        "When hopelessness takes over, it can feel like the darkness will never end. Please remember that feelings are temporary, even when they seem endless. Small steps and reaching out for support can create a path toward light and healing.",
        "It’s okay to feel overwhelmed and uncertain about the future. You’re not alone in this, and many people have faced similar feelings and found hope again. Would you like to talk about what’s weighing on you or explore ways to find meaning?",
        "Your feelings are valid and important. Sometimes sharing what you’re going through can lighten the burden and help you see possibilities you might not have noticed. I’m here to listen and support you through this difficult time.",
        "Help is available, and you don’t have to face these feelings alone. There are caring people and resources ready to support your healing journey. You matter deeply, and brighter days are possible."
      ],
      "context_set": ""
    },
    {
      "tag": "ConfidenceBoost",
      "patterns": [
        "I feel low confidence",
        "I don't believe in myself",
        "How to be more confident?",
        "I feel insecure",
        "I’m afraid to try new things",
        "I doubt my abilities",
        "I want to be more self-assured",
        "I get anxious about failure",
        "How to build self-esteem?"
      ],
      "responses": [
        "Building confidence is a gradual process that starts with being kind to yourself. Celebrate your small victories and recognize your unique strengths and talents. Everyone has moments of doubt, but your worth isn’t defined by those moments.",
        "Trying new things can be scary, but it’s also how growth happens. Remember that mistakes don’t define you—they’re opportunities to learn and improve. Would you like some practical tips to boost your confidence in daily life?",
        "Self-esteem improves when you practice positive self-talk and challenge negative thoughts. Surrounding yourself with supportive people can also help reinforce your value. I’m here to support you on this journey whenever you need.",
        "You have inherent worth just as you are. Taking small steps outside your comfort zone can build resilience and belief in yourself. It’s okay to ask for help and encouragement along the way."
      ],
      "context_set": ""
    },
    {
      "tag": "Burnout",
      "patterns": [
        "I feel burnt out",
        "I'm exhausted from work",
        "I have no energy",
        "Burnout symptoms",
        "I’m overwhelmed and tired",
        "I feel emotionally drained",
        "I can’t keep up with everything",
        "I’m losing motivation",
        "I need a break"
      ],
      "responses": [
        "Burnout happens when your mind and body are pushed beyond their limits for too long. It’s crucial to acknowledge your need for rest and self-care. Taking time off, setting boundaries, and prioritizing your well-being are essential steps toward recovery.",
        "You deserve to feel energized and fulfilled, not exhausted and overwhelmed. Sometimes reaching out to talk about your workload and feelings can help lighten the load. Would you like strategies for managing burnout or ideas for recharging?",
        "Feeling burned out can affect every part of your life, but recovery is possible with patience and support. Remember, taking breaks isn’t a weakness—it’s a necessary part of sustaining your health and happiness.",
        "You are important, and your well-being matters. Consider ways to balance your responsibilities with self-care, and don’t hesitate to seek professional guidance if you need additional support."
      ],
      "context_set": ""
    },
    {
      "tag": "BodyImage",
      "patterns": [
        "I hate how I look",
        "I'm unhappy with my body",
        "I feel ugly",
        "Negative body image",
        "I compare myself to others",
        "I’m self-conscious about my appearance",
        "How to love my body?",
        "I feel ashamed of how I look",
        "I want to feel better about myself"
      ],
      "responses": [
        "Your worth is not defined by your appearance but by the unique person you are inside. Negative body image can be painful, but learning to appreciate your body for what it does and the strength it holds can be healing.",
        "Comparing yourself to others often leads to feelings of inadequacy, but everyone has their own journey. Practicing self-compassion and focusing on your positive qualities can shift your perspective toward acceptance and love.",
        "It’s okay to have tough days with body image, but remember you deserve kindness from yourself. Would you like resources or strategies to help build a more positive and healthy relationship with your body?",
        "You are valuable exactly as you are. Your body is your home, and treating it with care and respect helps nurture both physical and emotional health."
      ],
      "context_set": ""
    },
    {
      "tag": "Addiction",
      "patterns": [
        "I can't stop drinking",
        "I'm addicted to something",
        "I want to quit drugs",
        "Addiction problems",
        "I feel trapped by addiction",
        "I need help with addiction",
        "How to overcome addiction?",
        "I’m struggling with substance use",
        "I want to be free from addiction"
      ],
      "responses": [
        "Addiction is a complex and challenging struggle, but recovery is absolutely possible. Seeking support from professionals, support groups, and loved ones can provide the strength and tools you need to heal and rebuild your life.",
        "Acknowledging the problem is a courageous first step. You don’t have to face this alone—there are many resources and compassionate people ready to help you on your journey to freedom and health.",
        "Recovery involves patience, self-compassion, and often professional guidance. Every small step forward is a victory. If you want, I can help you find support groups or treatment options in your area.",
        "You deserve a life free from addiction’s control. Remember, setbacks can happen but don’t define your path. Keep reaching out and taking care of yourself—you’re stronger than you think."
      ],
      "context_set": ""
    },
    {
      "tag": "RelaxationTechniques",
      "patterns": [
        "How to relax?",
        "Help me calm down",
        "Relaxation tips",
        "Ways to relax",
        "I’m feeling tense",
        "I want to reduce stress",
        "How to unwind?",
        "Relaxation exercises",
        "What can help me relax?"
      ],
      "responses": [
        "Relaxation techniques like deep breathing, progressive muscle relaxation, or guided imagery can help calm your mind and body. These methods help reduce tension and promote a sense of peace even during stressful times.",
        "Listening to soothing music, spending time in nature, or practicing gentle yoga are wonderful ways to relax and recharge. Would you like me to guide you through a relaxation exercise right now?",
        "It’s important to find what works best for you. Sometimes simple activities like reading a favorite book or taking a warm bath can provide comfort and relaxation.",
        "Taking regular breaks to focus on yourself and your well-being helps maintain balance and reduce stress. You deserve moments of calm and care."
      ],
      "context_set": ""
    },
    {
      "tag": "AngerManagement",
      "patterns": [
        "How to control anger?",
        "I get angry easily",
        "Tips for anger management",
        "I lose my temper",
        "I want to calm down",
        "I feel rage inside",
        "How to stay calm?",
        "I explode with anger",
        "Anger issues"
      ],
      "responses": [
        "Managing anger starts with recognizing your triggers and learning techniques to calm yourself before anger escalates. Counting to ten, deep breathing, or taking a brief walk can help diffuse intense feelings.",
        "Expressing anger in a healthy way is important. Finding safe outlets like journaling, talking with a trusted person, or engaging in physical activity can channel your emotions constructively.",
        "It’s okay to feel angry—it’s a natural emotion. The goal is to respond thoughtfully rather than react impulsively. Would you like guidance on anger management strategies that might work for you?",
        "Remember, anger doesn’t have to control you. Developing patience and self-awareness takes time, but with support and practice, you can find peace even in frustrating moments."
      ],
      "context_set": ""
    },
    {
      "tag": "HealthyHabits",
      "patterns": [
        "How to build healthy habits?",
        "Tips for good lifestyle",
        "I want to be healthier",
        "Healthy living advice",
        "How to eat better?",
        "How to exercise regularly?",
        "How to sleep better?",
        "Ways to improve my health",
        "How to stay motivated for health?"
      ],
      "responses": [
        "Building healthy habits starts with small, achievable goals. Consistency is more important than perfection—try to make gradual changes that you can maintain over time.",
        "A balanced lifestyle includes regular physical activity, nutritious eating, enough restful sleep, and mental self-care. All these parts work together to support your overall well-being.",
        "Rewarding yourself for small successes can keep motivation high. Would you like a simple plan to start incorporating healthy habits into your daily routine?",
        "Remember, every positive step, no matter how small, contributes to your health and happiness. Be patient and kind to yourself as you build habits that serve you best."
      ],
      "context_set": ""
    },
    {
      "tag": "GriefSupport",
      "patterns": [
        "I lost someone",
        "I am grieving",
        "Feeling sad after loss",
        "How to cope with grief?",
        "I miss them so much",
        "I can’t move on",
        "Grieving process",
        "I feel empty after loss",
        "I’m heartbroken"
      ],
      "responses": [
        "Grief is a deeply personal and often difficult journey. It’s okay to feel a wide range of emotions, from sadness to anger. Taking your time and seeking support from loved ones or professionals can help you heal.",
        "Losing someone you care about can feel overwhelming. Remember that healing doesn’t mean forgetting; it means finding ways to carry their memory while continuing your life. I’m here to listen whenever you need.",
        "There’s no 'right' way to grieve. Allow yourself to feel without judgment, and reach out when you’re ready. Would you like some suggestions on coping strategies or resources to support you?",
        "Your feelings of loss matter deeply. Connecting with others who understand or joining a support group can provide comfort. You are not alone in this, even when it feels like it."
      ],
      "context_set": ""
    },
    {
      "tag": "NegativeThoughts",
      "patterns": [
        "I have negative thoughts",
        "I keep thinking bad things",
        "My mind is full of negativity",
        "I feel hopeless",
        "I can’t stop the negative voice",
        "How do I get rid of bad thoughts?",
        "My thoughts are hurting me",
        "I feel stuck in negativity"
      ],
      "responses": [
        "Negative thoughts can be persistent, but they don’t define who you are. Challenging and reframing these thoughts can lessen their impact over time.",
        "Practicing mindfulness and focusing on positive affirmations may help reduce the hold of negative thinking. Would you like some exercises to try?",
        "Remember, you are not your thoughts. It’s okay to seek support when these feelings become overwhelming.",
        "With patience and practice, you can learn to create space for more balanced and hopeful thinking."
      ],
      "context_set": ""
    },
    {
      "tag": "SeekingHelp",
      "patterns": [
        "I want help",
        "How do I get support?",
        "Where can I find help?",
        "I don’t know what to do",
        "I need someone to talk to",
        "I want professional help",
        "I feel lost",
        "Can you guide me to resources?"
      ],
      "responses": [
        "It’s a strong and brave step to seek help, and there are many resources available to support you.",
        "Whether it’s talking to a trusted friend, family member, or professional, reaching out can make a big difference. Would you like information on local support or online resources?",
        "Remember, you don’t have to face challenges alone. Support is available whenever you’re ready.",
        "Taking the first step might feel difficult, but it often leads to hope and healing."
      ],
      "context_set": ""
    },
    {
      "tag": "PositiveThinking",
      "patterns": [
        "How to think positively?",
        "I want to be more optimistic",
        "How to stay hopeful?",
        "I need to change my mindset",
        "How to see the bright side?",
        "I want to improve my outlook",
        "How to stay positive during hard times?",
        "How to build optimism?"
      ],
      "responses": [
        "Positive thinking involves focusing on your strengths and looking for opportunities even in challenges. It doesn’t mean ignoring difficulties but finding hope and solutions.",
        "Try practicing gratitude daily and reminding yourself of past successes. Would you like some tips on building a positive mindset?",
        "Remember, optimism can be cultivated over time with patience and practice.",
        "Being kind to yourself and surrounding yourself with supportive people also helps sustain a hopeful outlook."
      ],
      "context_set": ""
    }
  ]
}
